<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Spatial Media Metadata Injector.</string>
	<key>Identifier</key>
	<string>com.github.swy.download.SpatialMediaMetadataInjector</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Spatial Media Metadata Injector</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
        <key>Arguments</key>
        <dict>
            <key>asset_regex</key>
            <string>.*\.mac\.zip</string>
            <key>github_repo</key>
            <string>google/spatial-media</string>
        </dict>
        <key>Processor</key>
        <string>GitHubReleasesInfoProvider</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
