<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Spatial Media Metadata Injector.</string>
	<key>Identifier</key>
	<string>com.github.swy.download.SpatialMediaMetadataInjector</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://github-cloud.s3.amazonaws.com/releases/30674951/7bda2a9a-096c-11e6-960b-8e0a39aebc0a.zip?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAISTNZFOVBIJMK3TQ%2F20160503%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Date=20160503T140413Z&amp;X-Amz-Expires=300&amp;X-Amz-Signature=68e3770afd3e5434e662a77d636c74a77656eb7611b3aa789e438d9c318ad47d&amp;X-Amz-SignedHeaders=host&amp;actor_id=1143538&amp;response-content-disposition=attachment%3B%20filename%3D360.Video.Metadata.Tool.mac.zip&amp;response-content-type=application%2Foctet-stream</string>
		<key>NAME</key>
		<string>Spatial Media Metadata Injector</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
